{"name":"Computing & Website Development HND/BSc (Hons)","children":[{"name": "CPU4000","size": 20,"children": [{"name":"Scholarship","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "The module introduces students to the scholarly requirements of study in HE at level 4. It concentrates on key scholarly requirements, in terms of study skills (e.g. academic writing, giving a presentation), information skills (retrieving and referencing information) and self-management skills (knowing ones learning style, producing a personal development plan).  
However, to give this scholarly apparatus more salience, each Cluster will develop these skills within the context of a particular area of content central to that particular subject. It will seek to develop not just knowledge but also the various practical and conceptual tools that will provide a firm foundation for future success in their area.
By the nature of the module, students will experience learning in different contexts: in lectures, participation in seminars, engaging in smaller groupwork, one-to-one support, blended learning and, more generally, operating within a Virtual Learning Environment (VLE) and additional digital resources.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "As a Level 4 module, students will be given sufficient class-contact time to ensure their learning is supported.  There are quite a few generic HE skills for students to master, hence the lecture content and practical classes, backed up by VLE material; but there is also a need for smaller group support, which the tutorials will provide, during which ePDPs will be fostered. Finally, the seminars will give different Clusters the opportunity to customise these skills by cultivating them within the context of pertinent subject matter.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "Aside from the continuous formative assessment in class (asking questions, soliciting feedback), there will be more systematic activities such as the following: quizzes; a Learning Style questionnaire; production of a timetable; preparation of an ePDP; interactive discussions and debates (online, off-line and blended).","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "As this module involves students from across the Faculty, summative assessment will be by Portfolio, which will involve various components (e.g. oral presentation, written assignment, ePDP)","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Tutors will provide feedback on the formative components within no more than 10 working days of their submission. This may be in writing or orally.
 
Tutors will provide provisional written summative feedback and grade on summative components within no more than 15 working days of its submission.","size": 20}]}]},{"name": "CPU4003","size": 20,"children": [{"name":"Introduction to Programming","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "The purpose of this module is to give you a thorough introduction to the theory and practice of object oriented programming.
For most students taking this module, this will be a first insight into computer programming using an object oriented (OO) programming language so no prior knowledge is assumed.
Initially you will be introduced to OO concepts such as classes, objects, constructors, methods etc and later introduced to more complex concepts such as aggregation and inheritance. You will be taught to design, implement and test simple classes; this leads into the design, implementation and documentation using UML (Unified Modelling Language) of simple applications. During this stage you will be introduced to appropriate control structures for selection and iteration (repetition).  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  The module will be delivered in integrated laboratory sessions. The sessions include lectures, demonstrations, and task/assignment-based work.  In the practical elements of the sessions you will perform a number of tasks related to the syllabus. These tasks will be used to help you develop your skills and knowledge.  You will also contribute to class/group discussions (face-to-face and online) related to OO concepts, program design with UML, language syntax and programming algorithms. The purpose of this is to develop your skills in articulating problems encountered and identifying/evaluating alternative approaches used in software development.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "You will regularly undertake activities/tasks in class and receive feedback.  You will also keep a reflective log summarising what you have learnt each week based on open questions, problems you encountered and solutions found.  Through this strategy you will demonstrate your progress each week and receive feedback on the approach you are taking and the extent to which you are progressing towards your goal.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "Summative assessment will involve two components: written assignment and an in-class test.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU4005","size": 20,"children": [{"name":"Networking Fundamentals","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module follows part one of the Cisco Certified Network Associate (CCNA) curriculum. Cisco is the leading vendor of networking equipment and their CCNA qualification is widely recognised and valued in the industry. This module integrates University teaching and assessments with Ciscos own material. 
You will study the core principles of networking. You will study theoretical aspects of networking to understand communication between devices on a network. There are plenty of opportunities to work on practical exercises using laboratory equipment and simulators to practice the skills you will need to configure network devices. 
You will undertake Cisco assessments as well as university assessments as you work towards Cisco certification. Some of the Cisco assessments will also count towards your university module result.
Network skills are based on agreed International standards. The CCNA qualification is taught and recognised worldwide.   Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "The module adopts a blended learning strategy. You will have access to extensive online materials including notes which you will need to read in advance of each weeks teaching and interactive activities. You will need to attend timetabled classes each week. A weekly lecture will reinforce the main principles of the weeks material. You will undertake an online test each week to measure your understanding of the taught material. This test mark does not contribute to the University summative assessment but does count towards the Cisco evaluation and will help you to further develop your understanding in areas where there may be gaps. The timetabled practical sessions will provide an opportunity to apply theory and practical skills learned from the taught material and practice them using lab equipment or simulators.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "You will have weekly online tests and will be provided with detailed feedback on your progress and understanding of the module topics. These results, together with the practical experience gained in the lab and discussions with tutors, will give you ongoing feedback on your ability to tackle practical problems via realistic scenarios.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will complete a practical scenario to demonstrate you have acquired the skills and understanding of network design. A formal unseen time-constrained examination will test your understanding of the underlying theory and concepts. ","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU4001","size": 20,"children": [{"name":"Website Production","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module will introduce you to the principles of good design, layout and development practices for the creation of websites, focusing strongly on web accessibility and user experience issues for all users, but especially looking at those who may have ability impairments and developing solutions to assist them in their browsing experience in line with the Universitys policy on diversity.

You will learn how to layout and develop a website using Hyper Text Markup Language (HTML) and JavaScript to add functionality and interactivity to your website.  You will also learn how to incorporate CSS (Cascading Style Sheets) to enhance the usability, layout and presentation of a website. 

You will learn about the issues of copyright on the web and you will have an understanding of how you can avoid becoming both a culprit and a victim of copyright theft.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  

You will attend lectures, seminars and tutorials so that you learn the theoretical content and also have demonstrations and practical hands-on sessions so that you can develop and practice the skills needed to devise your own website. 

There will also be online sources and activities so that you can explore topics of interest and have online discussions with peers and your tutor.  
You will also use the internet-based applications to conduct advanced searches.  
You will also use the internet to find appropriate websites to evaluate prior to creating your own website.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The timetabled online activity support is intended to provide a mechanism to allow you to gain on-going feedback on the work you are preparing throughout the module. Online tools such as discussion forums and/or wikis will be used to support these activities. You will be able to discuss your work with staff prior to assessment deadlines  this discussion will take place face-to-face and online.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "There are two items of assessment on which you will be graded and the grades for them will determine your overall grade for the module.  

In the first, you will write a technical report based upon a case study to demonstrate your achievement of the learning outcomes for the module. 

In the second, you will analyse a case study and develop a website using the skills you have learned throughout the module. You will also write a report on how you achieved your final design.

This work will be assessed by the module academic team and feedback will be provided on the work.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Feedback on formative assessment will be given in class. Feedback on summative assessment work will normally be available within two weeks of the hand-in date and no later than three weeks. ","size": 20}]}]},{"name": "CPU4002","size": 20,"children": [{"name":"Information Systems and Databases","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "The language of information systems, files, records, fields, databases and spreadsheets. The use of an integrated environment to create and manipulate data to support information requirements, support tables, queries and forms. Human aspects of systems. Modelling tools and their use in systems development.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means you will have face-to-face sessions as well as online learning.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "For formative assessment, you will:
	Model an information system
	Make a contribution to a seminar based on group work
	Develop a set of queries based on an existing database 
	Extract the data from certain queries
	Utilise the data extracted using some other platform, e.g. Excel
You will receive feedback on these so that you learn and improve your knowledge and skills as the module progresses. ","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "For summative assessment you will undertake a project in which you will produce a design based on a case study, implement the design and write a report concerning the solution.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "No Learning Resources have been specified.","size": 20}]}]},{"name": "CPU4004","size": 20,"children": [{"name":"Computer Platforms","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "The module explores the diverse range of modern devices which are classified as computing devices. Computing devices range from supercomputers at the high end down to domestic appliances such as washing machines at the low end. Equipment as diverse as televisions and mobile phones are capable of running stored programs and have applications available for download. The module examines what makes a computer; the components of a computer system; how programmes are executed and the role of modern operating systems.
In addition, the module looks at the environmental impact of design decisions on every aspect of the computer system in terms of hardware, software and power consumption. The design of computing devices, choice of materials, development of software and the use of the end product can all have an environmental impact. Designers, developers and users of computing devices can all make decisions throughout the product lifecycle which have positive or negative impacts on the environment. We examine how we can make an impact at each stage.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  There will be timetabled activities where you will attend classes at scheduled times. There will also be distance learning materials and activities which will be accessible online at any time. Standard lectures will be held during which tutors will explain the broad concepts, and in practical workshop sessions you will be able to test theoretical concepts on real equipment. There will be a series of weekly seminars at which you will be encouraged to contribute to the group discussion on selected topics.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The timetabled online activity support is intended to provide a mechanism for you to gain ongoing feedback on the work you are preparing throughout the module. Online tools such as discussion forums and/or wikis will be used to support these activities. You will able to discuss your work with staff prior to assessment deadlines.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will write technical articles and complete a case study to demonstrate your achievement of the learning outcomes for the module.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU5001","size": 20,"children": [{"name":"Web Programming","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "In module CPU4001 Website Production, you gained an understanding of the use of the Hypertext Markup Language (HTML) to create static web page content and Cascading Style Sheets (CSS) to style that content.  This module looks at how to make web sites more interactive (i.e. dynamic) by the use of client-side and server-side scripting.  Scripting is a lightweight form a programming.  A client-side script is a lightweight program, the code for which is often embedded in the HTML code, which runs locally on the users browser when a web page is requested from a remote web server.  A server-side script is a lightweight program that runs on a remote web-server instead of in the users browser.  Server-side scripting opens up an exciting area of web development in that it allows websites to interact with remote data storage systems such as relational database management systems (RDBMS) or data files written in the Extensible Markup Language (XML).   Having completed this module you will be able to create useful, dynamic web sites that interact with remote data storage systems.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  There will be timetabled activities where you will attend classes at scheduled times. There will also be distance learning materials and activities which will be accessible online at any time. Standard lectures will be held during which tutors will explain the broad concepts, and in practical workshop sessions you will be able to test theoretical concepts on real equipment. There will be a series of weekly seminars at which you will be encouraged to contribute to the group discussion on selected topics.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The supervised time in the workshop is intended to provide a mechanism for you to gain ongoing feedback on the weekly programming exercises and assignment work you are developing throughout the module.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will develop web sites and supporting documentation to demonstrate your achievement of the learning outcomes for the module.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Formative feedback will be provided face-to-face and online.
The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU5002","size": 20,"children": [{"name":"Database Theory and Practice","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module aims to enhance your database skills with a detailed look at modern data storage systems, including relational databases and XML systems.  Specifying, designing, managing and optimising  databases will be covered, in addition to Structured Query Language (SQL) and web interfaces to back-end databases.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "The module adopts a blended learning strategy. A weekly lecture will introduce the main principles of the weeks material. You will have the opportunity to practice practical skills in scheduled workshop sessions. There will be the opportunity to discuss material related to the course in seminar or tutorial sessions where you will be able to get support with areas you do not yet fully understand. Online tools such as discussion forums will be used to offer additional support out of hours.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "You will have the opportunity to discuss your work in tutorial sessions to measure your understanding of the subject area. Module tutors will offer guidance on assignment work prior to hand-in to help you improve your work.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will be given a design task to a database system by following an appropriate design methodology based on a case study. The examination will allow you to demonstrate your understanding and application of the theoretical aspects of the module using realistic examples.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Verbal feedback on questions and assignment work shown in class before hand-in will normally be immediate. The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU5003","size": 20,"children": [{"name":"Unix","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "UNIX is at the computing heart of many organisations and for the majority of the worlds enterprise level applications it is the operating system of choice. UNIX systems tend to be larger than those used for office applications and some UNIX systems now involve hundreds of thousands of processors.  Skills in UNIX are of benefit to almost anyone working in the IT sector as it is used for web servers as well as hosting large corporate applications. The increasing popularity of LINUX (a form of UNIX) has led to what is now an ever increasing deployment among small business and private users.

This module develops essential skills in the administration and management of networked computer systems running UNIX/LINUX. It builds on the knowledge of computer networks, programming and operating systems that you gained in the first year. It is a highly technical module in which you will develop hand on real world skills that will enable you to exploit this powerful operating system.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means you will have face-to-face sessions as well as online learning. Class time is spent in the labs working with the UNIX operating system under tutor direction and support. Outside of class sessions, online materials are available as is remote access to the UNIX network enabling you to develop your skills at your own pace and convenience.  You will also participate in online discussions and activities.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "During scheduled classes you will be provided with feedback on your progress. Prior to assignment submission, a week is set aside when you are encouraged to bring your completed assignment to the tutor for feedback. You will also participate in online discussions and activities and receive feedback.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "For summative assessment you will undertake a technical assignment which involves the development of a script/program that assists UNIX systems administration.

Time constrained exam.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The module tutor will provide you with formative feedback on your coursework prior to submission so that you will be able to act on it prior to submitting your work for summative assessment. In addition, you will receive ongoing formative feedback on your progress as you participate in learning activities both in class and online. Feedback will be face-to-face and online.

The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU5000","size": 20,"children": [{"name":"Level 2 Project","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module builds on the Scholarship module studied in the first year.  It will provide you with the opportunity to investigate in depth a topic relevant to industry, analyse the information gained and communicate the findings in a literature survey and written report. The module will develop your ability to undertake a research project. The two main approaches, quantitative and qualitative, will be covered and the module will focus on how data and information can be collected and analysed. You will also refresh your knowledge of research ethics. You will learn how to manage your project in terms of time, workload and documentation.  The module is designed to help you to maximise your potential for entry into the graduate workplace. Employability skills such as  time and self-management, customer awareness, problem solving and the application of creative and innovative approaches will be addressed.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means you will have face-to-face sessions as well as online learning.  You will have lectures and seminars to help you learn about research methods; this will be supported by online activities and discussions. You will have a project supervisor and will agree the aims and objectives of your project with him/her.  You will work on your project under the supervision of your designated supervisor. Your supervisor will give you support and feedback during schedules sessions.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "Aside from the continuous formative assessment in class (asking questions, soliciting feedback), online and in traditional face-to-face sessions, there will be more systematic activities such as research exercises and presenting research findings.  You will be able to discuss your project with your supervisor as it progresses.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will present two items of assessment for summative assessment.  The first is a reflective literature review and the second is a portfolio of your research work.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The module tutor will provide feedback on the main formative components not more than 10 working days of their submission. This may be in writing or given verbally. In addition, you will receive ongoing formative feedback on your progress when you attend tutorials with your tutor and participate in learning activities both in class and online.

The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU5004","size": 20,"children": [{"name":"Mobile Applications Design","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "Mobile devices such as phones, smartphones and tablet computers are a fast growing segment of the computing market. These devices are rapidly becoming mainstream for presenting information and media. 
This module deals with the creation of content for mobile devices. You will look at the different design criteria for hand-held devices and adapt your approach to the structure, navigation and presentation of content accordingly. Where appropriate you explore the multiplatform approach to content creation where formatting techniques can be used to re-purpose the same content for use on multiple classes of device.
You will learn about multiplatform approaches such as web design and the design of platform-specific applications (apps) and consider which approach is best for specific circumstances. You will also design server-side applications to deliver information and content to multiple devices. Supporting multiple end user devices with the least duplication of effort is a key goal for designers and developers in this area.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "The module adopts a blended learning strategy. A weekly lecture will introduce the main principles of the weeks material. You will have the opportunity to practice practical skills in scheduled workshop sessions. There will be the opportunity to discuss material related to the course in seminar or tutorial sessions where you will be able to get support with areas you do not yet fully understand. Online tools such as discussion forums will be used to offer additional support out of hours.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "You will have the opportunity to discuss your work in tutorial sessions to measure your understanding of the subject area. Module tutors will offer guidance on assignment work prior to hand-in to help you improve your work.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will be given a design task to develop client and server elements of a system to deliver information using mobile devices. You will be asked to prepare a report recommending a suitable mobile device strategy based on your understanding of the current state of the market and future trends.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU5005","size": 20,"children": [{"name":"Internet Applications and Server Systems","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "Software applications that are designed to operate within a web browser are referred to as web applications.  They are often designed and developed according to the principles of either a 3-layer model (presentation layer, business logic layer and data abstraction layer) or a software design pattern such as the Model, View, Control (MVC) pattern.  

Having gained an understanding of object-oriented programming in CPU4003 Introduction to Programming, this module will apply your skills to creating dynamic web applications using industry standard, object-oriented programming (OOP) languages and methodologies to provide client-side and server-side functionality.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  There will be timetabled activities where you will attend classes at scheduled times. There will also be distance learning materials and activities which will be accessible online at any time. Standard lectures will be held during which tutors will explain the broad concepts, and in practical workshop sessions you will be able to test theoretical concepts on real equipment. There will be a series of weekly seminars at which you will be encouraged to contribute to the group discussion on selected topics.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The supervised time in the workshop is intended to provide a mechanism for you to gain ongoing feedback on the weekly programming exercises and assignment work you are developing throughout the module.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "There is one assessment in which you will a develop web site and supporting documentation to demonstrate your achievement of the learning outcomes for the module.
There is an end-of-module, written examination to test your understanding of the specified module learning outcomes.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Formative feedback on the coursework assessment will be provided face-to-face and online each week during the practical sessions.
The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU6000","size": 20,"children": [{"name":"Professional Issues in Computing","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module develops an understanding of the professional and legal constraints within which computing specialists operate.  The module operates using a discursive environment where you will be confronted with the social and ethical issues of using technology.  
The module develops and consolidates your ability to undertake a major research project. The two main approaches, quantitative and qualitative, will be explicated, exemplifying how data is collected and analysed within each of these areas, looking at the different conceptual frameworks and tools available.  
Skills learnt will include: how to manage your project in terms of time, workload, and record-keeping; how to undertake an effective literature search including the use of digital resources; and, lastly, how to communicate your work effectively.
The module helps to develop in you a mature attitude to working as an ethical, environmentally aware, computer or information systems professional.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means you will have face-to-face sessions as well as online learning. As a final year student, you will be expected to undertake more independent study, though guided and supported by staff.  Blended learning lectures, alongside the Virtual Learning Environment (VLE) support materials, will help you to become au fait with the rudiments of research, whereas the seminar programme will allow you to apply and enrich this knowledge base within the context of your particular subject area.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "Aside from the continuous formative assessment in class (asking questions, soliciting feedback), online and in traditional face-to-face sessions, there will be more systematic activities such as the following: a research exercise and presenting research findings.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "Summative assessment will be by Portfolio, which will involve various components (e.g. Bibliography arising out of research, oral presentation, written report)","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU6001","size": 20,"children": [{"name":"Major Project","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "The Major Project module is undertaken by all the undergraduate students in the faculty in their final year. It is a substantial piece of work that will enable you to demonstrate the extent of your achievement on the degree as a whole. The range of projects will vary but the following features will be common to all:

You will be allocated a member of academic staff to act as a supervisor once your area of study is agreed;
Before work on the major project can commence, you will define the projects terms of reference as a document which will include:

Aims and objectives consistent with the SMARTER notion (Specific, Measurable, Achievable, Realistic, Timed, Extending, Relevant);
Appropriate consideration of research ethics and health and safety practice in line with University policy.
A proposed project timetable including deadlines for deliverables
The terms of reference document must be approved by the project team before work can commence.

The range of investigations undertaken by students varies considerably and will depend on your programme of study. Staff will provide a number of project ideas which you can undertake for their project, alternatively you may present your own project idea for approval using a project proforma document.

The Module Guide will provide further advice regarding your Major Project, including attendance requirements, supervisory arrangements, assessment criteria and arrangements. 

BCS Accreditation 

The British Computer Society has some specific requirements for project students wishing to gain BCS accreditation:
i.  The project must lead to the production of an artefact
ii. You must pass the project on the first attempt
  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "None Specified","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The Terms of Reference will be reviewed and approved before the project can commence. You will have regular meetings and discussions with your supervisor to monitor and review your progress. Supervisors can review and comment on draft work before it is submitted. You will have an opportunity to present your project in its early stages to other students in class time.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "The standard assessment items in the project module act as milestones to keep you on an appropriate schedule.
The final version of the Terms of Reference will be marked in the middle of the first trimester. You will produce a summary of their initial background research as an Interim Research Report at the end of the first trimester. At the end of the project you will deliver a Final Report which fully documents your background research, analysis and design, experimental results and conclusions (as appropriate for their specific project). After the final report there will be a Viva presentation which may include a demonstration of the artefact if one was produced.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU6002","size": 20,"children": [{"name":"Web Application Project Management","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module aims to provide you with a rounded view of project management in multimedia/computing environments where many technologies and workflows are used to develop a product that is to be produced on time and to budget. 

The module will take you through a full project, often an industrial brief, that has real deadlines, clients and budgets using a project management methodology where you will be expected to produce the project and supporting documentation to meet the clients needs. 

This module will provide you with an understanding of the processes involved in project management and the importance of  rapid project development for fast moving computing and multimedia industries.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A combination of lectures, seminars, demonstrations and in-class course work will be used to introduce the subject matter and to develop understanding. Students will be encouraged to critically analyse examples in peer review. As well as traditional classroom teaching methods the module will use a blended learning approach to teaching.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "Formative assessment will take place in the development of a production website or industrial brief to be delivered on time, to budget and meeting the proposed brief. ","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "Summative assessment will take the form of an evaluative exercise that provides the documentation required in order to successfully kick-off a project. Additionally you will be required to undertake a written report that provides critical analysis of the methodologies undertaken in the formative assessment and synthesises an appropriate project management methodology based upon research.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Feedback will be given for both formative and summative assessment using a blend of face to face and online methods. Additionally Regular Feedback will be delivered throughout the module within workshop sessions and in tutorials.
The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU6004","size": 20,"children": [{"name":"Network Security","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "As networked computers have become mission critical to all but the smallest enterprises we need to protect them from deliberate and accidental disruption. There are many hostile groups on the Internet who seek to penetrate and damage computer networks for profit or sometimes for fun. Attackers may target specific high-value companies or individuals; alternatively they may be attacking anyone and everyone.
As an individual you will have a role to play in keeping your own data and systems safe. If you act for an organisation, you may well be responsible for protecting that companys data and reputation.
In this module you will assess the risks in various scenarios. In depth analysis of the threats and the strategies for countering the threats will be evaluated. This is a fast-paced subject area where threats and counter-measures are constantly evolving. You will have the opportunities to configure and test equipment such as firewalls and routers to harden them against attack.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  There will be timetabled activities where you will attend classes at scheduled times. There will also be distance learning materials and activities which will be accessible online at any time. Standard lectures will be held during which tutors will explain the broad concepts, and in practical workshop sessions you will be able to test theoretical concepts on real equipment.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The timetabled online activity support is intended to provide a mechanism for you to gain ongoing feedback on the work you are preparing throughout the module. Online tools, such as discussion forums and/or wikis, will be used to support these activities. You will be able to discuss your work with staff prior to assessment deadlines.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will look at an illustrative case study and prepare a report based on your observations. As part of the case study you will prepare a simulated solution for part of the network demonstrating your ability to configure equipment appropriately.
The exam will test your ability to evaluate different technologies and approaches and to discuss fully their impact in a network environment.
","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Formative feedback will be provided face-to-face and online.

The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU6003","size": 20,"children": [{"name":"Web and Systems Based Programming","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "This module studies how business enterprises can integrate their operations over the Internet.  The topic areas you will study are based on the semantic web which provides a common framework allowing data to be shared and reused across application, enterprise, and community boundaries.  

You will study the implementation of a Service-Oriented Architecture (SOA) which is a set of principles and methodologies for designing and developing software in the form of interoperable services.  The services are created as software components which define business functions.

At the heart of SOA are web services that allow one company to request functionality offered by a second company leading to the integration of their web-based, business operations.  Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  There will be timetabled activities where you will attend classes at scheduled times. There will also be distance learning materials and activities which will be accessible online at any time. Standard lectures will be held during which tutors will explain the broad concepts, and in practical workshop sessions you will be able to test theoretical concepts on real equipment. There will be a series of weekly seminars at which you will be encouraged to contribute to the group discussion on selected topics.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The supervised time in the workshop is intended to provide a mechanism for you to gain ongoing feedback on the weekly programming exercises and assignment work you are developing throughout the module.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will a develop web application based on the use of web services and write supporting documentation to demonstrate your achievement of the learning outcomes for the module.
There will be a written examination testing your knowledge of the items specified in the required learning objectives.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Formative feedback will be provided face-to-face and online.
The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},{"name": "CPU6005","size": 20,"children": [{"name":"Facilitating E-commerce","size": 60},{"name": "Delivery Type","size": 20,"children": [{"name": "This Module requires you to attend particular classes or events at particular times and in particular locations.","size": 20}]},{"name": "Pre-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Co-Requisites","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Barred Combinations","size": 20,"children": [{"name": "None Specified","size": 20}]},{"name": "Module Outline","size": 20,"children": [{"name": "E-commerce relates to the buying and selling of products over an electronic system such as the global network.  The main aim of this module is to study how secure e-commerce transactions are carried out between customers and businesses over the Web.

There are many legal requirements concerning the purchasing of goods and services over the Web. These, together with issues relating to security and business profitability make this module very relevant to todays global economy.    Bolton values: Taught (T), Developed (D) and Assessed (A).","size": 20}]},{"name": "Learning And Teaching Strategy","size": 20,"children": [{"name": "A blended learning approach is used in the module which means that you will attend sessions face-to-face and also use online learning.  There will be timetabled activities where you will attend classes at scheduled times. There will also be distance learning materials and activities which will be accessible online at any time. Standard lectures will be held during which tutors will explain the broad concepts, and in practical workshop sessions you will be able to test theoretical concepts on real equipment. There will be a series of weekly seminars at which you will be encouraged to contribute to the group discussion on selected topics.","size": 20},{"name": "Formative Assessment Strategy","size": 20,"children": [{"name": "The supervised time in the workshop is intended to provide a mechanism for you to gain ongoing feedback on the weekly programming exercises and assignment work you are developing throughout the module.","size": 20}]},{"name": "Summative Assessment Strategy","size": 20,"children": [{"name": "You will develop web site incorporating an E-commerce facility.
There is a written examination testing your knowledge of the items specified in the required learning objectives.","size": 20}]}]},{"name": "Feedback to Students","size": 20,"children": [{"name": "Formative feedback will be provided face-to-face during the supervised workshop sessions and online.
The AMT faculty policy on timescales for feedback explained in the faculty handbook at www.bolton.ac.uk/amt will be followed.","size": 20}]}]},]}